; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/transport/domain.pddl
; updates:
;  - removed :action-costs and :functions
;  - capacity type now is size
;  - capacity-number predicate now is capacity
(define (domain transport)
  (:requirements :typing)
  (:types
        size location locatable - object
        vehicle package - locatable
  )

  (:predicates
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - size)
     (capacity-predecessor ?s1 ?s2 - size)
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
      )
  )

)

; problem
;; vehicles=6, packages=15, locations=15, max_capacity=2, out_folder=training/easy, instance_id=86, seed=127

(define (problem transport-86)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 v6 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 l14 l15 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c1)
    (capacity v3 c1)
    (capacity v4 c1)
    (capacity v5 c2)
    (capacity v6 c1)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l7)
    (at p2 l4)
    (at p3 l5)
    (at p4 l11)
    (at p5 l11)
    (at p6 l14)
    (at p7 l15)
    (at p8 l15)
    (at p9 l5)
    (at p10 l7)
    (at p11 l1)
    (at p12 l6)
    (at p13 l5)
    (at p14 l9)
    (at p15 l12)
    (at v1 l14)
    (at v2 l2)
    (at v3 l15)
    (at v4 l7)
    (at v5 l2)
    (at v6 l13)
    (road l6 l12)
    (road l14 l4)
    (road l5 l7)
    (road l4 l15)
    (road l11 l2)
    (road l10 l9)
    (road l2 l11)
    (road l1 l9)
    (road l13 l8)
    (road l6 l11)
    (road l7 l13)
    (road l12 l6)
    (road l3 l9)
    (road l4 l14)
    (road l9 l1)
    (road l9 l10)
    (road l11 l7)
    (road l9 l13)
    (road l13 l7)
    (road l15 l4)
    (road l15 l13)
    (road l13 l15)
    (road l9 l3)
    (road l11 l6)
    (road l8 l13)
    (road l13 l9)
    (road l7 l5)
    (road l7 l11)
    (road l9 l15)
    (road l15 l9)
    (road l4 l8)
    (road l8 l4)
    (road l12 l14)
    (road l14 l12)
    (road l1 l4)
    (road l4 l1)
    (road l6 l13)
    (road l13 l6)
    (road l1 l14)
    (road l14 l1)
    (road l12 l15)
    (road l15 l12)
    (road l8 l14)
    (road l14 l8)
    (road l2 l14)
    (road l14 l2)
    (road l8 l10)
    (road l10 l8)
    (road l10 l15)
    (road l15 l10)
    (road l11 l13)
    (road l13 l11)
    (road l3 l13)
    (road l13 l3)
    (road l5 l9)
    (road l9 l5)
    (road l2 l7)
    (road l7 l2)
    (road l7 l9)
    (road l9 l7)
    (road l2 l12)
    (road l12 l2)
    (road l6 l15)
    (road l15 l6)
    (road l4 l10)
    (road l10 l4)
    (road l5 l8)
    (road l8 l5)
    (road l4 l11)
    (road l11 l4)
    (road l9 l12)
    (road l12 l9)
    (road l2 l6)
    (road l6 l2)
    (road l4 l5)
    (road l5 l4)
    (road l10 l14)
    (road l14 l10)
    )
 (:goal  (and 
    (at p1 l9)
    (at p2 l13)
    (at p3 l15)
    (at p4 l8)
    (at p5 l3)
    (at p6 l4)
    (at p7 l5)
    (at p8 l3)
    (at p9 l1)
    (at p10 l13)
    (at p11 l14)
    (at p12 l9)
    (at p13 l8)
    (at p14 l2)
    (at p15 l11))))

; plan
1. (drive v1 l14 l2)
   deleted: (at v1 l14)
   added: (at v1 l2)
   goals met: 0 of 15
2. (drive v1 l2 l7)
   deleted: (at v1 l2)
   added: (at v1 l7)
   goals met: 0 of 15
3. (pick-up v1 l7 p1 c0 c1)
   deleted: (at p1 l7) (capacity v1 c1)
   added: (in p1 v1) (capacity v1 c0)
   goals met: 0 of 15
4. (drive v1 l7 l9)
   deleted: (at v1 l7)
   added: (at v1 l9)
   goals met: 0 of 15
5. (drop v1 l9 p1 c0 c1)
   deleted: (in p1 v1) (capacity v1 c0)
   added: (at p1 l9) (capacity v1 c1)
   goals met: 1 of 15
6. (drive v1 l9 l1)
   deleted: (at v1 l9)
   added: (at v1 l1)
   goals met: 1 of 15
7. (drive v1 l1 l4)
   deleted: (at v1 l1)
   added: (at v1 l4)
   goals met: 1 of 15
8. (pick-up v1 l4 p2 c0 c1)
   deleted: (at p2 l4) (capacity v1 c1)
   added: (in p2 v1) (capacity v1 c0)
   goals met: 1 of 15
9. (drive v1 l4 l15)
   deleted: (at v1 l4)
   added: (at v1 l15)
   goals met: 1 of 15
10. (drive v1 l15 l13)
   deleted: (at v1 l15)
   added: (at v1 l13)
   goals met: 1 of 15
11. (drop v1 l13 p2 c0 c1)
   deleted: (in p2 v1) (capacity v1 c0)
   added: (at p2 l13) (capacity v1 c1)
   goals met: 2 of 15
12. (drive v1 l13 l8)
   deleted: (at v1 l13)
   added: (at v1 l8)
   goals met: 2 of 15
13. (drive v1 l8 l5)
   deleted: (at v1 l8)
   added: (at v1 l5)
   goals met: 2 of 15
14. (pick-up v1 l5 p3 c0 c1)
   deleted: (at p3 l5) (capacity v1 c1)
   added: (in p3 v1) (capacity v1 c0)
   goals met: 2 of 15
15. (drive v1 l5 l9)
   deleted: (at v1 l5)
   added: (at v1 l9)
   goals met: 2 of 15
16. (drive v1 l9 l15)
   deleted: (at v1 l9)
   added: (at v1 l15)
   goals met: 2 of 15
17. (drop v1 l15 p3 c0 c1)
   deleted: (in p3 v1) (capacity v1 c0)
   added: (at p3 l15) (capacity v1 c1)
   goals met: 3 of 15
18. (drive v1 l15 l4)
   deleted: (at v1 l15)
   added: (at v1 l4)
   goals met: 3 of 15
19. (drive v1 l4 l11)
   deleted: (at v1 l4)
   added: (at v1 l11)
   goals met: 3 of 15
20. (pick-up v1 l11 p4 c0 c1)
   deleted: (at p4 l11) (capacity v1 c1)
   added: (in p4 v1) (capacity v1 c0)
   goals met: 3 of 15
21. (drive v1 l11 l13)
   deleted: (at v1 l11)
   added: (at v1 l13)
   goals met: 3 of 15
22. (drive v1 l13 l8)
   deleted: (at v1 l13)
   added: (at v1 l8)
   goals met: 3 of 15
23. (drop v1 l8 p4 c0 c1)
   deleted: (in p4 v1) (capacity v1 c0)
   added: (at p4 l8) (capacity v1 c1)
   goals met: 4 of 15
24. (drive v1 l8 l13)
   deleted: (at v1 l8)
   added: (at v1 l13)
   goals met: 4 of 15
25. (drive v1 l13 l11)
   deleted: (at v1 l13)
   added: (at v1 l11)
   goals met: 4 of 15
26. (pick-up v1 l11 p5 c0 c1)
   deleted: (at p5 l11) (capacity v1 c1)
   added: (in p5 v1) (capacity v1 c0)
   goals met: 4 of 15
27. (drive v1 l11 l13)
   deleted: (at v1 l11)
   added: (at v1 l13)
   goals met: 4 of 15
28. (drive v1 l13 l3)
   deleted: (at v1 l13)
   added: (at v1 l3)
   goals met: 4 of 15
29. (drop v1 l3 p5 c0 c1)
   deleted: (in p5 v1) (capacity v1 c0)
   added: (at p5 l3) (capacity v1 c1)
   goals met: 5 of 15
30. (drive v1 l3 l9)
   deleted: (at v1 l3)
   added: (at v1 l9)
   goals met: 5 of 15
31. (drive v1 l9 l1)
   deleted: (at v1 l9)
   added: (at v1 l1)
   goals met: 5 of 15
32. (drive v1 l1 l14)
   deleted: (at v1 l1)
   added: (at v1 l14)
   goals met: 5 of 15
33. (pick-up v1 l14 p6 c0 c1)
   deleted: (at p6 l14) (capacity v1 c1)
   added: (in p6 v1) (capacity v1 c0)
   goals met: 5 of 15
34. (drive v1 l14 l4)
   deleted: (at v1 l14)
   added: (at v1 l4)
   goals met: 5 of 15
35. (drop v1 l4 p6 c0 c1)
   deleted: (in p6 v1) (capacity v1 c0)
   added: (at p6 l4) (capacity v1 c1)
   goals met: 6 of 15
36. (drive v1 l4 l15)
   deleted: (at v1 l4)
   added: (at v1 l15)
   goals met: 6 of 15
37. (pick-up v1 l15 p7 c0 c1)
   deleted: (at p7 l15) (capacity v1 c1)
   added: (in p7 v1) (capacity v1 c0)
   goals met: 6 of 15
38. (drive v1 l15 l4)
   deleted: (at v1 l15)
   added: (at v1 l4)
   goals met: 6 of 15
39. (drive v1 l4 l5)
   deleted: (at v1 l4)
   added: (at v1 l5)
   goals met: 6 of 15
40. (drop v1 l5 p7 c0 c1)
   deleted: (in p7 v1) (capacity v1 c0)
   added: (at p7 l5) (capacity v1 c1)
   goals met: 7 of 15
41. (drive v1 l5 l9)
   deleted: (at v1 l5)
   added: (at v1 l9)
   goals met: 7 of 15
42. (drive v1 l9 l15)
   deleted: (at v1 l9)
   added: (at v1 l15)
   goals met: 7 of 15
43. (pick-up v1 l15 p8 c0 c1)
   deleted: (at p8 l15) (capacity v1 c1)
   added: (in p8 v1) (capacity v1 c0)
   goals met: 7 of 15
44. (drive v1 l15 l13)
   deleted: (at v1 l15)
   added: (at v1 l13)
   goals met: 7 of 15
45. (drive v1 l13 l3)
   deleted: (at v1 l13)
   added: (at v1 l3)
   goals met: 7 of 15
46. (drop v1 l3 p8 c0 c1)
   deleted: (in p8 v1) (capacity v1 c0)
   added: (at p8 l3) (capacity v1 c1)
   goals met: 8 of 15
47. (drive v1 l3 l9)
   deleted: (at v1 l3)
   added: (at v1 l9)
   goals met: 8 of 15
48. (drive v1 l9 l5)
   deleted: (at v1 l9)
   added: (at v1 l5)
   goals met: 8 of 15
49. (pick-up v1 l5 p9 c0 c1)
   deleted: (at p9 l5) (capacity v1 c1)
   added: (in p9 v1) (capacity v1 c0)
   goals met: 8 of 15
50. (drive v1 l5 l9)
   deleted: (at v1 l5)
   added: (at v1 l9)
   goals met: 8 of 15
51. (drive v1 l9 l1)
   deleted: (at v1 l9)
   added: (at v1 l1)
   goals met: 8 of 15
52. (drop v1 l1 p9 c0 c1)
   deleted: (in p9 v1) (capacity v1 c0)
   added: (at p9 l1) (capacity v1 c1)
   goals met: 9 of 15
53. (drive v1 l1 l9)
   deleted: (at v1 l1)
   added: (at v1 l9)
   goals met: 9 of 15
54. (drive v1 l9 l7)
   deleted: (at v1 l9)
   added: (at v1 l7)
   goals met: 9 of 15
55. (pick-up v1 l7 p10 c0 c1)
   deleted: (at p10 l7) (capacity v1 c1)
   added: (in p10 v1) (capacity v1 c0)
   goals met: 9 of 15
56. (drive v1 l7 l13)
   deleted: (at v1 l7)
   added: (at v1 l13)
   goals met: 9 of 15
57. (drop v1 l13 p10 c0 c1)
   deleted: (in p10 v1) (capacity v1 c0)
   added: (at p10 l13) (capacity v1 c1)
   goals met: 10 of 15
58. (drive v1 l13 l9)
   deleted: (at v1 l13)
   added: (at v1 l9)
   goals met: 10 of 15
59. (drive v1 l9 l1)
   deleted: (at v1 l9)
   added: (at v1 l1)
   goals met: 10 of 15
60. (pick-up v1 l1 p11 c0 c1)
   deleted: (at p11 l1) (capacity v1 c1)
   added: (in p11 v1) (capacity v1 c0)
   goals met: 10 of 15
61. (drive v1 l1 l14)
   deleted: (at v1 l1)
   added: (at v1 l14)
   goals met: 10 of 15
62. (drop v1 l14 p11 c0 c1)
   deleted: (in p11 v1) (capacity v1 c0)
   added: (at p11 l14) (capacity v1 c1)
   goals met: 11 of 15
63. (drive v1 l14 l12)
   deleted: (at v1 l14)
   added: (at v1 l12)
   goals met: 11 of 15
64. (drive v1 l12 l6)
   deleted: (at v1 l12)
   added: (at v1 l6)
   goals met: 11 of 15
65. (pick-up v1 l6 p12 c0 c1)
   deleted: (at p12 l6) (capacity v1 c1)
   added: (in p12 v1) (capacity v1 c0)
   goals met: 11 of 15
66. (drive v1 l6 l12)
   deleted: (at v1 l6)
   added: (at v1 l12)
   goals met: 11 of 15
67. (drive v1 l12 l9)
   deleted: (at v1 l12)
   added: (at v1 l9)
   goals met: 11 of 15
68. (drop v1 l9 p12 c0 c1)
   deleted: (in p12 v1) (capacity v1 c0)
   added: (at p12 l9) (capacity v1 c1)
   goals met: 12 of 15
69. (drive v1 l9 l5)
   deleted: (at v1 l9)
   added: (at v1 l5)
   goals met: 12 of 15
70. (pick-up v1 l5 p13 c0 c1)
   deleted: (at p13 l5) (capacity v1 c1)
   added: (in p13 v1) (capacity v1 c0)
   goals met: 12 of 15
71. (drive v1 l5 l8)
   deleted: (at v1 l5)
   added: (at v1 l8)
   goals met: 12 of 15
72. (drop v1 l8 p13 c0 c1)
   deleted: (in p13 v1) (capacity v1 c0)
   added: (at p13 l8) (capacity v1 c1)
   goals met: 13 of 15
73. (drive v1 l8 l13)
   deleted: (at v1 l8)
   added: (at v1 l13)
   goals met: 13 of 15
74. (drive v1 l13 l9)
   deleted: (at v1 l13)
   added: (at v1 l9)
   goals met: 13 of 15
75. (pick-up v1 l9 p14 c0 c1)
   deleted: (at p14 l9) (capacity v1 c1)
   added: (in p14 v1) (capacity v1 c0)
   goals met: 13 of 15
76. (drive v1 l9 l7)
   deleted: (at v1 l9)
   added: (at v1 l7)
   goals met: 13 of 15
77. (drive v1 l7 l2)
   deleted: (at v1 l7)
   added: (at v1 l2)
   goals met: 13 of 15
78. (drop v1 l2 p14 c0 c1)
   deleted: (in p14 v1) (capacity v1 c0)
   added: (at p14 l2) (capacity v1 c1)
   goals met: 14 of 15
79. (drive v1 l2 l12)
   deleted: (at v1 l2)
   added: (at v1 l12)
   goals met: 14 of 15
80. (pick-up v1 l12 p15 c0 c1)
   deleted: (at p15 l12) (capacity v1 c1)
   added: (in p15 v1) (capacity v1 c0)
   goals met: 14 of 15
81. (drive v1 l12 l6)
   deleted: (at v1 l12)
   added: (at v1 l6)
   goals met: 14 of 15
82. (drive v1 l6 l11)
   deleted: (at v1 l6)
   added: (at v1 l11)
   goals met: 14 of 15
83. (drop v1 l11 p15 c0 c1)
   deleted: (in p15 v1) (capacity v1 c0)
   added: (at p15 l11) (capacity v1 c1)
   goals met: 15 of 15
